In [3]:
import numpy as np
import pandas as pd

In [25]:
np.random.seed(1234)
d1 = pd.Series(2*np.random.normal(size = 100)+3)
d2 = np.random.f(2,4, size = 100)
d3 = np.random.randint(1, 100, size=100)

In [26]:
d1

0     3.942870
1     0.618049
2     5.865414
3     2.374696
4     1.558823
        ...
95    2.836106
96    2.310468
97    4.056576
98    0.862022
99    1.976237
Length: 100, dtype: float64

In [8]:
d1.count()

100

In [9]:
d1.min()

-4.1270333212494705

In [10]:
d1.max()

7.781921030926066

In [11]:
d1.idxmin()

81

In [12]:
d1.idxmax()

39

In [13]:
d1.quantile(0.1)

0.6870184644069929

In [14]:
d1.sum()

307.0224566250873

In [15]:
d1.mean()

3.070224566250873

In [16]:
d1.median()

3.204555266776845

In [75]:
d1.mode()

0    -4.127033
1    -1.800907
2    -1.485370
3    -1.149955
4    -1.042510
        ...
95    5.865414
96    6.091318
97    7.015686
98    7.061207
99    7.781921
Length: 100, dtype: float64

In [18]:
d1.var()

4.005609378535087

In [19]:
d1.std()

2.001401853335578

In [20]:
d1.mad()

1.5112880411556104

In [21]:
d1.skew()

-0.6494780760484293

In [22]:
d1.kurt()

1.2201094052398012

In [23]:
d1.describe()

count    100.000000
mean       3.070225
std        2.001402
min       -4.127033
25%        2.040101
50%        3.204555
75%        4.434788
max        7.781921
dtype: float64

In [27]:
def status(x):
    return pd.Series([x.count, x.min(), x.idxmin(), x.quantile(.25), x.median(), x.quantile(.75), x.mean(), x.max(), x.idxmax(), x.mad(), x.var(), x.std(), x.skew(), x.kurt()], index=['Всего','Минимум','Минимальная позиция',"25% квантиль",'медиана',"75% квантиль",'Значить','Максимум','Максимальное количество цифр','Среднее абсолютное отклонение','дисперсия','Среднеквадратичное отклонение','Асимметрия','Эксцесс'])

In [28]:
df = pd.DataFrame(status(d1))
df

                                                                               0
Всего                          <bound method Series.count of 0     3.942870\n...
Минимум                                                                -4.127033
Минимальная позиция                                                           81
25% квантиль                                                            2.040101
медиана                                                                 3.204555
75% квантиль                                                            4.434788
Значить                                                                 3.070225
Максимум                                                                7.781921
Максимальное количество цифр                                                  39
Среднее абсолютное отклонение                                           1.511288
дисперсия                                                               4.005609
Среднеквадратичное отклонение                                           2.001402
Асимметрия                                                             -0.649478
Эксцесс                                                                 1.220109

In [29]:
df = pd.DataFrame(np.array([d1, d2, d3]).T, columns=['x1', 'x2', 'x3'])
df.head()

         x1        x2    x3
0  3.942870  1.369531  55.0
1  0.618049  0.943264  68.0
2  5.865414  0.590663  73.0
3  2.374696  0.206548  59.0
4  1.558823  0.223204  60.0

In [30]:
df.apply(status)

,x1,x2,x3
Всего,<bound method Series.count of 0 3.942870\n...,<bound method Series.count of 0 1.369531\n...,<bound method Series.count of 0 55.0\n1 ...
Минимум,-4.127033,0.01433,3.0
Минимальная позиция,81,72,76
25% квантиль,2.040101,0.24958,25.0
медиана,3.204555,1.000613,54.5
75% квантиль,4.434788,2.101581,73.0
Значить,3.070225,2.028608,51.49
Максимум,7.781921,18.791565,98.0
Максимальное количество цифр,39,53,96
Среднее абсолютное отклонение,1.511288,1.922669,24.0108
дисперсия,4.005609,10.206447,780.090808
Среднеквадратичное отклонение,2.001402,3.194753,27.930106
Асимметрия,-0.649478,3.326246,-0.118917
Эксцесс,1.220109,12.636286,-1.211579

In [31]:
bank = pd.read_csv('bank-full.csv')
bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,Target
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [33]:
result = bank['age'].describe()
pd.DataFrame(result)

                age
count  45211.000000
mean      40.936210
std       10.618762
min       18.000000
25%       33.000000
50%       39.000000
75%       48.000000
max       95.000000

In [35]:
result = bank.describe(include = ['object'])
result

,job,marital,education,default,housing,loan,contact,month,poutcome,Target
count,45211,45211,45211,45211,45211,45211,45211,45211,45211,45211
unique,12,3,4,2,2,2,3,12,4,2
top,blue-collar,married,secondary,no,yes,no,cellular,may,unknown,no
freq,9732,27214,23202,44396,25130,37967,29285,13766,36959,39922

In [38]:
result = bank.describe(include=['number'])
result

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [42]:
bank.describe(include=['number'])

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [43]:
bank.drop('job', axis=1)

,age,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,Target
0,58,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45206,51,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown,yes
45207,71,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown,yes
45208,72,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success,yes
45209,57,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown,no
45210,37,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other,no

In [44]:
bank.sort_values(by=['job','age'])

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,Target
11517,20,admin.,single,secondary,no,66,yes,no,unknown,19,jun,75,2,-1,0,unknown,no
40121,20,admin.,single,secondary,no,336,no,yes,cellular,5,jun,133,1,-1,0,unknown,no
3929,21,admin.,single,secondary,no,325,yes,no,unknown,16,may,467,1,-1,0,unknown,no
6279,21,admin.,single,unknown,no,-28,yes,no,unknown,27,may,125,1,-1,0,unknown,no
31405,21,admin.,single,tertiary,no,242,no,yes,cellular,26,mar,131,4,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41823,75,unknown,married,tertiary,no,643,no,no,cellular,15,oct,522,2,-1,0,unknown,no
43653,77,unknown,married,unknown,no,397,no,no,telephone,7,may,300,3,-1,0,unknown,yes
45141,77,unknown,married,unknown,no,397,no,no,telephone,8,nov,207,1,185,3,success,no
32089,78,unknown,married,unknown,no,2235,no,no,telephone,14,apr,300,3,-1,0,unknown,yes
41524,82,unknown,divorced,unknown,no,0,no,no,telephone,9,sep,277,5,-1,0,unknown,no

In [47]:
bank.sort_values(by=['job','age'], ascending=False)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,Target
41524,82,unknown,divorced,unknown,no,0,no,no,telephone,9,sep,277,5,-1,0,unknown,no
32089,78,unknown,married,unknown,no,2235,no,no,telephone,14,apr,300,3,-1,0,unknown,yes
43653,77,unknown,married,unknown,no,397,no,no,telephone,7,may,300,3,-1,0,unknown,yes
45141,77,unknown,married,unknown,no,397,no,no,telephone,8,nov,207,1,185,3,success,no
41823,75,unknown,married,tertiary,no,643,no,no,cellular,15,oct,522,2,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
31405,21,admin.,single,tertiary,no,242,no,yes,cellular,26,mar,131,4,-1,0,unknown,no
38479,21,admin.,single,secondary,no,66,yes,no,cellular,15,may,31,1,330,2,failure,no
39651,21,admin.,single,secondary,no,524,no,no,cellular,26,may,185,1,-1,0,unknown,yes
11517,20,admin.,single,secondary,no,66,yes,no,unknown,19,jun,75,2,-1,0,unknown,no
40121,20,admin.,single,secondary,no,336,no,yes,cellular,5,jun,133,1,-1,0,unknown,no

In [48]:
student = {'Name':['Bob','Alice','Carol','Henry','Judy','Robert','William'],
           'Age':[12,16,13,11,14,15,24],
           'Sex':['M','F','M','M','F','M','F']}
score = {'Name':['Bob','Alice','Carol','Henry','William'],
         'Score':[75,35,87,86,57]}

df_student = pd.DataFrame(student)
df_student

      Name  Age Sex
0      Bob   12   M
1    Alice   16   F
2    Carol   13   M
3    Henry   11   M
4     Judy   14   F
5   Robert   15   M
6  William   24   F

In [49]:
df_score = pd.DataFrame(score)
df_score

      Name  Score
0      Bob     75
1    Alice     35
2    Carol     87
3    Henry     86
4  William     57

In [53]:
stu_score1 = pd.merge(df_student, df_score, on='Name')
stu_score1

      Name  Age Sex  Score
0      Bob   12   M     75
1    Alice   16   F     35
2    Carol   13   M     87
3    Henry   11   M     86
4  William   24   F     57

In [79]:
stu_score2 = pd.merge(df_student, df_score, on='Name', how='left')
stu_score2

      Name  Age Sex  Score
0      Bob   12   M   75.0
1    Alice   16   F   35.0
2    Carol   13   M   87.0
3    Henry   11   M   86.0
4     Judy   14   F    NaN
5   Robert   15   M    NaN
6  William   24   F   57.0

In [77]:
sum(pd.isnull(stu_score2['Score']))

2

In [57]:
stu_score2.dropna()

      Name  Age Sex  Score
0      Bob   12   M   75.0
1    Alice   16   F   35.0
2    Carol   13   M   87.0
3    Henry   11   M   86.0
6  William   24   F   57.0

In [61]:
df = pd.DataFrame([[1,2,3],[3,4,np.nan],
                  [12,23,43],[55,np.nan,10],
                  [np.nan,np.nan,np.nan],[np.nan,1,2]],
                  columns=['a1','a2','a3'])
df

     a1    a2    a3
0   1.0   2.0   3.0
1   3.0   4.0   NaN
2  12.0  23.0  43.0
3  55.0   NaN  10.0
4   NaN   NaN   NaN
5   NaN   1.0   2.0

In [60]:
df.dropna()

     a1    a2    a3
0   1.0   2.0   3.0
2  12.0  23.0  43.0

In [62]:
df.dropna(how='all')

     a1    a2    a3
0   1.0   2.0   3.0
1   3.0   4.0   NaN
2  12.0  23.0  43.0
3  55.0   NaN  10.0
5   NaN   1.0   2.0

In [63]:
df.fillna(0)

     a1    a2    a3
0   1.0   2.0   3.0
1   3.0   4.0   0.0
2  12.0  23.0  43.0
3  55.0   0.0  10.0
4   0.0   0.0   0.0
5   0.0   1.0   2.0

In [64]:
df.fillna(method='ffill')

     a1    a2    a3
0   1.0   2.0   3.0
1   3.0   4.0   3.0
2  12.0  23.0  43.0
3  55.0  23.0  10.0
4  55.0  23.0  10.0
5  55.0   1.0   2.0

In [65]:
df.fillna(method='bfill')

     a1    a2    a3
0   1.0   2.0   3.0
1   3.0   4.0  43.0
2  12.0  23.0  43.0
3  55.0   1.0  10.0
4   NaN   1.0   2.0
5   NaN   1.0   2.0

In [68]:
df.fillna({'a1':100, 'a2':200, 'a3':300})

      a1     a2     a3
0    1.0    2.0    3.0
1    3.0    4.0  300.0
2   12.0   23.0   43.0
3   55.0  200.0   10.0
4  100.0  200.0  300.0
5  100.0    1.0    2.0

In [71]:
a1_median = df['a1'].median()
a1_median

7.5

In [72]:
a2_mean = df['a2'].mean()
a2_mean

7.5

In [73]:
a3_mean = df['a3'].mean()
a3_mean

14.5

In [74]:
df.fillna({'a1':a1_median, 'a2':a2_mean, 'a3':a3_mean})

     a1    a2    a3
0   1.0   2.0   3.0
1   3.0   4.0  14.5
2  12.0  23.0  43.0
3  55.0   7.5  10.0
4   7.5   7.5  14.5
5   7.5   1.0   2.0

In [81]:
mean = 10
std = 3
size = 100
data = np.random.normal(mean, std, size)
df = pd.DataFrame({'Значение':data})
df

     Значение
0    6.991734
1   11.570638
2   12.464552
3    9.553774
4    9.863889
..        ...
95   8.395428
96   9.935206
97   6.684425
98   6.832161
99  13.064067

[100 rows x 1 columns]

In [82]:
df.mean()

Значение    10.245824
dtype: float64

In [86]:
df.median()

Значение    10.015091
dtype: float64

In [84]:
df.min()

Значение    4.827849
dtype: float64

In [87]:
df.max()

Значение    16.312232
dtype: float64

In [88]:
df.std()

Значение    2.812994
dtype: float64

In [89]:
df.quantile(0.25)

Значение    8.127041
Name: 0.25, dtype: float64

In [91]:
df.quantile(0.5)

Значение    10.015091
Name: 0.5, dtype: float64

In [92]:
df.quantile(0.75)

Значение    12.35164
Name: 0.75, dtype: float64

In [93]:
df.describe()

         Значение
count  100.000000
mean    10.245824
std      2.812994
min      4.827849
25%      8.127041
50%     10.015091
75%     12.351640
max     16.312232

In [94]:
df.idxmax()

Значение    28
dtype: int64

In [95]:
df.idxmin()

Значение    57
dtype: int64

In [96]:
df.skew()

Значение    0.167144
dtype: float64

In [97]:
df.kurt()

Значение   -0.848847
dtype: float64

In [102]:
students = {
    'Student_ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Isaac', 'Jack']
}

grades = {
    'Student_ID': [101, 102, 103, 104, 105, 106, 107, 108, 110, 111],
    'Grade': [85, 90, 78, 92, 88, 76, 95, 89, 83, 79]
}


students_df = pd.DataFrame(students)
grades_df = pd.DataFrame(grades)

students_df

   Student_ID     Name
0         101    Alice
1         102      Bob
2         103  Charlie
3         104    David
4         105      Eve
5         106    Frank
6         107    Grace
7         108   Hannah
8         109    Isaac
9         110     Jack

In [103]:
grades_df

   Student_ID  Grade
0         101     85
1         102     90
2         103     78
3         104     92
4         105     88
5         106     76
6         107     95
7         108     89
8         110     83
9         111     79

In [105]:
pd.merge(students_df, grades_df, on='Student_ID', how='inner')

   Student_ID     Name  Grade
0         101    Alice     85
1         102      Bob     90
2         103  Charlie     78
3         104    David     92
4         105      Eve     88
5         106    Frank     76
6         107    Grace     95
7         108   Hannah     89
8         110     Jack     83

In [106]:
pd.merge(students_df, grades_df, on='Student_ID', how='left')

   Student_ID     Name  Grade
0         101    Alice   85.0
1         102      Bob   90.0
2         103  Charlie   78.0
3         104    David   92.0
4         105      Eve   88.0
5         106    Frank   76.0
6         107    Grace   95.0
7         108   Hannah   89.0
8         109    Isaac    NaN
9         110     Jack   83.0

In [115]:
new_student = {'Student_ID': [111], 'Name': ['Kate']}
students_df = students_df.append(pd.DataFrame(new_student), ignore_index=True)
students_df

/var/folders/t1/pt8lfl0s2rz_z_7z9cbm9f5r0000gn/T/ipykernel_44821/3821306398.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  students_df = students_df.append(pd.DataFrame(new_student), ignore_index=True)

    Student_ID     Name
0          101    Alice
1          102      Bob
2          103  Charlie
3          104    David
4          105      Eve
5          106    Frank
6          107    Grace
7          108   Hannah
8          109    Isaac
9          110     Jack
10         111     Kate

In [116]:
pd.merge(students_df, grades_df, on='Student_ID', how='left')

    Student_ID     Name  Grade
0          101    Alice   85.0
1          102      Bob   90.0
2          103  Charlie   78.0
3          104    David   92.0
4          105      Eve   88.0
5          106    Frank   76.0
6          107    Grace   95.0
7          108   Hannah   89.0
8          109    Isaac    NaN
9          110     Jack   83.0
10         111     Kate   79.0

In [117]:
pd.merge(students_df, grades_df, on='Student_ID', how='inner')

   Student_ID     Name  Grade
0         101    Alice     85
1         102      Bob     90
2         103  Charlie     78
3         104    David     92
4         105      Eve     88
5         106    Frank     76
6         107    Grace     95
7         108   Hannah     89
8         110     Jack     83
9         111     Kate     79

In [120]:
merge_df = pd.merge(students_df, grades_df, on='Student_ID', how='left')
merge_df

    Student_ID     Name  Grade
0          101    Alice   85.0
1          102      Bob   90.0
2          103  Charlie   78.0
3          104    David   92.0
4          105      Eve   88.0
5          106    Frank   76.0
6          107    Grace   95.0
7          108   Hannah   89.0
8          109    Isaac    NaN
9          110     Jack   83.0
10         111     Kate   79.0

In [121]:
merge_df.dropna()

    Student_ID     Name  Grade
0          101    Alice   85.0
1          102      Bob   90.0
2          103  Charlie   78.0
3          104    David   92.0
4          105      Eve   88.0
5          106    Frank   76.0
6          107    Grace   95.0
7          108   Hannah   89.0
9          110     Jack   83.0
10         111     Kate   79.0

In [124]:
median = merge_df['Grade'].median()
median

86.5

In [125]:
merge_df.fillna(median)

    Student_ID     Name  Grade
0          101    Alice   85.0
1          102      Bob   90.0
2          103  Charlie   78.0
3          104    David   92.0
4          105      Eve   88.0
5          106    Frank   76.0
6          107    Grace   95.0
7          108   Hannah   89.0
8          109    Isaac   86.5
9          110     Jack   83.0
10         111     Kate   79.0